# NumberingSchemaTypes.StructuralNumberingSchemas Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
NumberingSchemaTypes..::..StructuralNumberingSchemas Properties
NumberingSchemaTypes..::..StructuralNumberingSchemas Class See Also
---
The NumberingSchemaTypes..::..StructuralNumberingSchemas type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Rebar | Built-in schema used for numbering rebar elements |
| RebarCoupler | Built-in schema used for numbering rebar coupler elements |
| ReinforcementFabric | Built-in schema used for numbering fabric reinforcement elements |

# See Also
NumberingSchemaTypes..::..StructuralNumberingSchemas Class
Autodesk.Revit.DB Namespace